App.Messages.addMessages('ru', {
    search: {
        instructions: {
            intro: 'Отсюда вы можете осуществлять поиск по данной документации. Введите слова для поиска в поле ниже и нажмите "поиск".',
            phrases: 'Используйте кавычки для поиска фраз, например, <code>"foo bar"</code>.',
            modifiers: 'Используйте <code>+</code>/<code>-</code> для требования/исключения, например, <code>+foo -bar</code>.',
            boolean: ' Используйте <code>AND</code>/<code>OR</code> и круглые скобки для булевых операций с приоритетом, например, <code>(foo AND bar) OR baz</code>.',
            notes: 'Если не используются булевы операции, по умолчанию должны совпадать <i>все</i> слова.'
        },
        pending: 'Поиск...',
        empty: 'Совпадений не найдено.',
        error: {
            generic: 'При выполнении поиска произошла ошибка. Пожалуйста, повторите попытку позже и сообщите о проблеме, если она не исчезнет.',
            syntax: 'Все поисковые термины должны быть длиной не менее 3 символов, причем минимум 1 термин должен присутствовать.'
        }
    }
});
